{
  "name": "Agenda",
  "date": "2021-2022",
  "time": "≈1 an",
  "nbrPeople": 1,
  "pathImage": "agenda/",
  "nbrImage":6,
  "language":"PHP,HTML,JQUERY,SQL,CSS",
  "linkGithub": "https://github.com/brahimilouis/my_rpg_2017",
  "body": [
    {
      "title" : "Description du projet",
      "text" : "Pendant ma quatrième année, celle où j'étais à Dublin, j'ai travaillé en free-lance à rythme de deux jours par semaine pour la société <a href='https://www.neolink.link/' target=_blanc>Neolink</a>. <br><br>Ma principale mission a été de réaliser une refonte entière d'une première version d'agenda pour le produit NeoGestion en utilisant <a href='https://fullcalendar.io/' target=_blanc>FullCalendar</a>. Pour cela j'ai collaboré avec un <strong>designer</strong> et un <strong>chef de projet</strong> qui était en collaboration avec le client pour développer cet agenda de façon <strong>agile</strong>.<br><br>Le défi principal de ce projet était d'avoir un agenda le plus <strong>optimisé</strong> possible pour une prise de rendez-vous, gestion évènement facile et rapide. Il fallait aussi développer un <strong>algorithme</strong> afin de choisir le référent de parcours le plus disponible et orienter les allocataires vers celui-ci."
    },
    {
      "title" : "Principales fonctionnalités de cet Agenda",
      "text" : "<ul><li>Avoir un excellent <strong>UI,UX</strong> afin de manipuler l'agenda : Drag and drop / Plusieurs vues d'agenda / couleur distinctes avec système de filtre</li><li>Pouvoir prendre plusieurs <strong>rendez-vous</strong> en même temps avec la possibilité d'<strong>ajouter</strong> une fréquence et <strong>modifier</strong> chaque rendez-vous indépendamment.</li><li>Avoir un système de <strong>notification paramétrable</strong> de rendez-vous</li><li>Pouvoir <strong>paramétrer</strong> une ‘Semaine type' (plages horaires de travail) et des plages de disponibilités ainsi que des évènements personnels de façon ponctuel ou récurant.</li><li>Pouvoir <strong>superposer</strong> plusieurs plannings d'utilisateurs afin d'avoir un visuel <strong>intuitif</strong> de plages disponibles / possibles / occupées pour choisir <strong>LA</strong> meilleur horaire de rendez-vous</li><li>Avoir une prise de rendez-vous d'orientation afin de pouvoir choisir avec l'aide d'un <strong>algorithme</strong> la personne la plus <strong>disponible</strong> pour ce rendez-vous</li><li>Avoir des <strong>visuels</strong> au passage de la souris sur un événement de l'agenda afin d'avoir plus de <strong>détails</strong></li><li>Pouvoir <strong>consulter</strong> et <strong>modifier</strong> un évènement dans une pop-up au clic sur l'agenda</li></ul>"
    }
  ]
}