{
  "name": "Agenda",
  "date": "2021-2022",
  "time": "≈1 an",
  "nbrPeople": 1,
  "pathImage": "agenda/",
  "nbrImage":6,
  "language":"PHP,HTML,JQUERY,SQL,CSS",
  "linkGithub": "https://github.com/brahimilouis/my_rpg_2017",
  "body": [
    {
      "title" : "Description du projet",
      "text" : "Pendant ma quatrième année à Dublin, j'ai travaillé en free-lance sur un rythme de deux jours par semaine pour la société <a href='https://www.neolink.link/' target=_blanc>Neolink</a>. <br><br>Ma principale mission a été de réaliser une refonte entière d'une première version d'agenda pour le produit <i>NeoGestion</i> en utilisant <a href='https://fullcalendar.io/' target=_blanc>FullCalendar</a>. Pour développer cet agenda de façon <strong>agile</strong>, j'ai collaboré avec un <strong>designer</strong> ainsi qu'un <strong>chef de projet</strong> qui était en relation directe avec le client.<br><br>Le défi principal de ce projet était d'avoir un agenda le plus <strong>optimisé</strong> possible pour une prise de rendez-vous, gestion évènement facile et rapide. Il fallait aussi développer un <strong>algorithme</strong> facilitant la prise de rendez-vous."
    },
    {
      "title" : "Principales fonctionnalités de cet Agenda",
      "text" : "<ul><li>Avoir un excellent <strong>UI,UX</strong> afin de manipuler l'agenda : Drag and drop / Plusieurs vues d'agenda / couleur distinctes avec système de filtre</li><li>Pouvoir prendre plusieurs <strong>rendez-vous</strong> en même temps avec la possibilité d'<strong>ajouter</strong> une fréquence et <strong>modifier</strong> chaque rendez-vous indépendamment.</li><li>Avoir un système de <strong>notification paramétrable</strong> de rendez-vous</li><li>Pouvoir <strong>paramétrer</strong> une ‘Semaine type' (plages horaires de travail) et des plages de disponibilités ainsi que des évènements personnels ponctuels ou récurants.</li><li>Pouvoir <strong>superposer</strong> plusieurs plannings d'utilisateurs afin d'avoir un visuel <strong>intuitif</strong> de plages disponibles / possibles / occupées pour choisir le meilleur horaire de rendez-vous</li><li>Développer un <strong>algorithme</strong> pour proposer des prises de rendez-vous selon la disponibilité et les interlocuteurs</li><li>Avoir des <strong>informations</strong> au passage de la souris sur un événement de l'agenda</li><li>Pouvoir <strong>consulter</strong> et <strong>modifier</strong> un évènement dans une pop-up au clic sur l'agenda</li></ul>"
    }
  ]
}