{
  "name": "My RPG",
  "date": "Mai 2018",
  "time": "3 semaines",
  "nbrPeople": 2,
  "pathImage": "rpg/",
  "nbrImage":7,
  "language":"C",
  "linkGithub": "https://github.com/brahimilouis/my_rpg_2017",
  "body": [
    {
      "title" : "But du projet",
      "text" : "<i>My RPG</i> est un projet graphique réalisé avec la librairie <a href='https://www.sfml-dev.org/index-fr.php' target=_blanc>CSFML</a> en 1ère année d'<a href='https://www.epitech.eu/' target=_blanc>Epitech</a>.<br>Le but de ce projet était de réaliser un <strong>RPG</strong>, ce qui signifie un jeu vidéo de rôle où le joueur incarne un personnage qui interagit avec son univers et ses propres caractéristiques.<br><br>L'école nous a donné une entière <strong>liberté</strong> sur le fonctionnement du jeu et son but. Il fallait alors <strong>imaginer</strong> et <strong>concevoir</strong> le jeu de de A à Z."
    },
    {
      "title" : "Notre RPG",
      "text" : "Vous allez incarner un aventurier qui, lors d'un voyage en bateau, se retrouve dans une tempête.<br> Malheureusement, après avoir lutté, le bateau fait naufrage sur une île où le personnage va vivre l'aventure de notre <strong>RPG</strong>. Pour s'en échapper il faudra qu'il suive une quête afin de récupérer les objets nécessaires. Pour cela le personnage se déplacera sur la carte et combattra un à un les monstres de l'île.<br><br>Nous avons choisi de faire un <strong>jeu ludique</strong> pour apprendre et améliorer l'écriture sur un clavier d'ordinateur. Au long de l'aventure le joueur devra remporter des combats en appuyant le plus vite possible sur une série de lettres aléatoire et gagnera des bonus lorsqu'il ne fait pas d'erreur."
    },
    {
      "title": "Quelques fonctionnalité de notre PRG",
      "text": "<ul><li>Un <strong>menu</strong> du jeu avec création d'un joueur - reprise d'une sauvegarde - tutoriel - réglage</li><li>Pouvoir <strong>personnaliser</strong> son personnage nom - couleur - sexe à la création et sauvegarder sa partie</li><li><strong>Jeu dynamique</strong> une cinématique de début et de fin - des effets de mouvement - des effets de particules - des musiques et effet sonore</li><li>Un <strong>système de collision</strong> et une carte qui évolue avec l'avancement de la quête.</li><li>Des <strong>interactions</strong> avec un <i>PNJ</i>, pouvoir voir la carte générale de l'ile ainsi que son inventaire qui évolue.</li></ul>"
    }
  ]
}